arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/driverlib/aux_adc.h
//*****************************************************************************
//
// Support for DriverLib in ROM:
// Redirect to implementation in ROM when available.
//
//*****************************************************************************
#ifndef DRIVERLIB_NOROM
    #include <driverlib/rom.h>
    #ifdef ROM_AUXADCDisable
        #undef  AUXADCDisable
        #define AUXADCDisable                   ROM_AUXADCDisable
    #endif
    #ifdef ROM_AUXADCEnableAsync
        #undef  AUXADCEnableAsync
        #define AUXADCEnableAsync               ROM_AUXADCEnableAsync
    #endif
    #ifdef ROM_AUXADCEnableSync
        #undef  AUXADCEnableSync
        #define AUXADCEnableSync                ROM_AUXADCEnableSync
    #endif
    #ifdef ROM_AUXADCDisableInputScaling
        #undef  AUXADCDisableInputScaling
        #define AUXADCDisableInputScaling       ROM_AUXADCDisableInputScaling
    #endif
    #ifdef ROM_AUXADCReenableInputScaling
        #undef  AUXADCReenableInputScaling
        #define AUXADCReenableInputScaling      ROM_AUXADCReenableInputScaling
    #endif
    #ifdef ROM_AUXADCFlushFifo
        #undef  AUXADCFlushFifo
        #define AUXADCFlushFifo                 ROM_AUXADCFlushFifo
    #endif
    #ifdef ROM_AUXADCReadFifo
        #undef  AUXADCReadFifo
        #define AUXADCReadFifo                  ROM_AUXADCReadFifo
    #endif
    #ifdef ROM_AUXADCPopFifo
        #undef  AUXADCPopFifo
        #define AUXADCPopFifo                   ROM_AUXADCPopFifo
    #endif
    #ifdef ROM_AUXADCGetAdjustmentGain
        #undef  AUXADCGetAdjustmentGain
        #define AUXADCGetAdjustmentGain         ROM_AUXADCGetAdjustmentGain
    #endif
    #ifdef ROM_AUXADCGetAdjustmentOffset
        #undef  AUXADCGetAdjustmentOffset
        #define AUXADCGetAdjustmentOffset       ROM_AUXADCGetAdjustmentOffset
    #endif
    #ifdef ROM_AUXADCValueToMicrovolts
        #undef  AUXADCValueToMicrovolts
        #define AUXADCValueToMicrovolts         ROM_AUXADCValueToMicrovolts
    #endif
    #ifdef ROM_AUXADCMicrovoltsToValue
        #undef  AUXADCMicrovoltsToValue
        #define AUXADCMicrovoltsToValue         ROM_AUXADCMicrovoltsToValue
    #endif
    #ifdef ROM_AUXADCAdjustValueForGainAndOffset
        #undef  AUXADCAdjustValueForGainAndOffset
        #define AUXADCAdjustValueForGainAndOffset ROM_AUXADCAdjustValueForGainAndOffset
    #endif
    #ifdef ROM_AUXADCUnadjustValueForGainAndOffset
        #undef  AUXADCUnadjustValueForGainAndOffset
        #define AUXADCUnadjustValueForGainAndOffset ROM_AUXADCUnadjustValueForGainAndOffset
    #endif
#endif

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // __AUX_ADC_H__

//*****************************************************************************
//
//! Close the Doxygen group.
//! @}
//
//*****************************************************************************
